# Sort by Index with `.sort_index()`

### Import Pandas

In [1]:
import pandas as pd

### Read CSV

In [2]:
salaries = pd.read_csv("mls_salaries.csv")

### Head

In [3]:
salaries.head(3)

  club last_name first_name position  base_salary  guaranteed_compensation
0  ATL   Almiron     Miguel        M    1912500.0                2297000.0
1  ATL   Ambrose      Mikey        D      65625.0                  65625.0
2  ATL      Asad      Yamil        M     150000.0                 150000.0

### Sort by Column

In [10]:
# sory by column and make it permanent
salaries.sort_values("base_salary", inplace=True)
salaries.head()

      club last_name first_name position  base_salary  guaranteed_compensation
348  NYCFC     Okoli       Sean        F     52999.92                 52999.92
523    SEA      Tolo     Nouhou        D     52999.92                 52999.92
138    DAL  Reynolds      Bryan        F     53000.00                 55000.00
462    POR  McIntosh    Kendall       GK     53000.00                 53000.00
222     KC  Zendejas     Adrian       GK     53000.00                 53000.00

In [12]:
# sory by column and make it permanent
salaries.sort_values("club", inplace=True)
salaries.head()

   club  last_name first_name position  base_salary  guaranteed_compensation
16  ATL   Martinez      Josef        F     924000.0                1041310.0
20  ATL  Parkhurst    Michael        D     325008.0                 325008.0
12  ATL       Kann       Alec       GK      77004.0                  77004.0
18  ATL      Mears     Tyrone        D     183756.0                 183756.0
9   ATL    Gressel     Julian      NaN      75000.0                  93750.0

### Sort by Index

In [11]:
# fix the index using sort_index()
salaries.sort_index()

    club last_name first_name position  base_salary  guaranteed_compensation
0    ATL   Almiron     Miguel        M    1912500.0               2297000.00
1    ATL   Ambrose      Mikey        D      65625.0                 65625.00
2    ATL      Asad      Yamil        M     150000.0                150000.00
3    ATL     Bloom       Mark        D      99225.0                106573.89
4    ATL  Carleton     Andrew        F      65000.0                 77400.00
..   ...       ...        ...      ...          ...                      ...
610  VAN   Teibert    Russell        M     126500.0                194000.00
611  VAN  Tornaghi      Paolo       GK      80000.0                 80000.00
612  VAN    Waston    Kendall        D     350000.0                368125.00
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                184000.00

[615 rows x 6 columns]

### We can also change the direction of the sort and use the `inplace=True` parameter

In [7]:
salaries.sort_index(ascending=False, inplace=True)

In [8]:
salaries.head()

    club last_name first_name position  base_salary  guaranteed_compensation
614  VAN  Williams    Sheanon        D     175000.0                 184000.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
612  VAN    Waston    Kendall        D     350000.0                 368125.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
610  VAN   Teibert    Russell        M     126500.0                 194000.0

This will also work on a Series in pretty much the same way.